In [16]:
import pandas as pd

dicio = {
    'Nome': ['Fernando', 'Marcelo', 'Miguel', 'Humberto'],
    'Gols': [2, 2, 4, 0],
    'Posição': ['Atacante', 'Meia', 'Atacante', 'Zagueiro'],
    'Altura': [1.82, 1.72, 1.65, 1.90]
}

In [4]:
# Iniciando o dataframe
jogadores = pd.DataFrame(dicio)
jogadores

       Nome  Gols   Posição  Altura
0  Fernando     2  Atacante    1.82
1   Marcelo     2      Meia    1.72
2    Miguel     4  Atacante    1.65
3  Humberto     0  Zagueiro    1.90

In [5]:
# Renomeando as colunas
jogadores.rename(columns={'Gols':'Nº de gols'}, inplace=True)
jogadores

       Nome  Nº de gols   Posição  Altura
0  Fernando           2  Atacante    1.82
1   Marcelo           2      Meia    1.72
2    Miguel           4  Atacante    1.65
3  Humberto           0  Zagueiro    1.90

In [6]:
# Exclusão usando o nome da coluna
jogadores.drop(columns=['Nº de gols'], inplace=True)

In [7]:
jogadores

       Nome   Posição  Altura
0  Fernando  Atacante    1.82
1   Marcelo      Meia    1.72
2    Miguel  Atacante    1.65
3  Humberto  Zagueiro    1.90

In [8]:
# Exclusão usando o índice
jogadores.drop(jogadores.columns[[2]], axis=1, inplace=True)
jogadores

       Nome   Posição
0  Fernando  Atacante
1   Marcelo      Meia
2    Miguel  Atacante
3  Humberto  Zagueiro

In [9]:
peso = {'Peso': [78, 67, 68, 81]}

peso = pd.DataFrame(peso)
peso

   Peso
0    78
1    67
2    68
3    81

In [10]:
jogadores_novo = pd.concat([jogadores, peso], axis=1)
jogadores_novo

       Nome   Posição  Peso
0  Fernando  Atacante    78
1   Marcelo      Meia    67
2    Miguel  Atacante    68
3  Humberto  Zagueiro    81

In [11]:
jogadores_novo2 = jogadores_novo.reindex(columns=['Nome', 'Posição', 'Peso', 'Altura'])
jogadores_novo2

       Nome   Posição  Peso  Altura
0  Fernando  Atacante    78     NaN
1   Marcelo      Meia    67     NaN
2    Miguel  Atacante    68     NaN
3  Humberto  Zagueiro    81     NaN

In [12]:
jogadores_novo2['IMC'] = round(jogadores_novo2['Peso'] / (jogadores_novo2['Altura'] ** 2), 2)
jogadores_novo2

       Nome   Posição  Peso  Altura  IMC
0  Fernando  Atacante    78     NaN  NaN
1   Marcelo      Meia    67     NaN  NaN
2    Miguel  Atacante    68     NaN  NaN
3  Humberto  Zagueiro    81     NaN  NaN

In [13]:
# Filtrando dados no Dataframe
jogadores.loc[jogadores['Altura'] > 1.80]

KeyError: 'Altura'

In [ ]:
# Filtrando dados no Dataframe
jogadores_novo2.loc[(jogadores['Posição'] == 'Atacante') & (jogadores_novo2['Peso'] < 70)]

In [ ]:
# Importando arquivo csv que está no projeto
players = pd.read_csv('Players.csv')
players

In [ ]:
players.isnull().sum()

In [ ]:
players['height'].isnull().sum()

In [ ]:
players.loc[players['height'].isnull()]

In [ ]:
players2 = players
players2 = players.dropna()
players2.isnull().sum()

In [ ]:
lista = [1.91, 1.90, 2.03, 1.95, 2.13]
lista1 = lista.sort()

print(sum(lista1) / len(lista1))

In [ ]:
players3 = players
players3['born'].isnull().sum()

In [ ]:
players3['born'].fillna(players3['born'].mean(), inplace=True)
players3['height'].fillna(players3['height'].median(), inplace=True)

In [ ]:
players3['birth_city'].fillna(players3['birth_city'].mode()[0], inplace=True)

In [ ]:
players3['birth_state'].fillna('Indiana', inplace=True)

In [ ]:
players3

In [ ]:
df = pd.read_excel('jogadores.xlsx')
df

In [ ]:
# Substituir os gols faltantes pela média

df['Gols'].fillna(df['Gols'].mean(), inplace=True)

In [ ]:
# Substituir a função pela moda
df['Função'].fillna(df['Função'].mode()[0], inplace=True)

In [ ]:
# Substituir a cidade por Fortaleza
df['Cidade'].fillna('Fortaleza', inplace=True)

In [ ]:
# Substituir a altura pela mediana
df['Altura'].fillna(df['Altura'].median(), inplace=True)

In [ ]:
df['Gols'] = round(df['Gols'],2)

In [ ]:
df.loc[df['Cidade'] == 'Fortaleza']

In [ ]:
df.replace('Fortaleza', 'fortaleza')

In [17]:
titanic = pd.read_csv('train.csv')
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [54]:
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [55]:
titanic['Age'].fillna(titanic['Age'].mean(), inplace=True)

In [56]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.000000,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.000000,0,0,370376,7.7500,NaN,Q

In [57]:
# Utilizando a função loc, faça a contagem de quantos passageiros sobreviveram e quantos morreram
titanic['Survived'].loc[titanic['Survived'] == 1].sum()

342

In [58]:
# Substitua os valores nulos da idade pela mediana
titanic['Age'].fillna(titanic['Age'].median(), inplace=True)

In [59]:
# Substitua os valores nulos do embarque para "porto"
titanic['Embarked'].fillna('porto', inplace=True)

In [61]:
# Qual a média de idade dos passageiros sobreviventes?
round(titanic['Age'].mean(),2)

29.7

In [62]:
# Qual a média de idade dos passageiros sobreviventes do sexo masculino e Feminino?
sobreviventes = titanic.loc[titanic['Survived'] == 1]
sobreviventes.groupby('Sex')['Age'].mean()

Sex
female    28.979263
male      27.631705
Name: Age, dtype: float64

In [ ]:
# Qual a média de idade dos passageiros não sobreviventes do sexo masculino e feminino?
nao_sobreviventes = titanic.loc[titanic['Survived'] == 0]
nao_sobreviventes.groupby('Sex')['Age'].mean()

In [63]:
# Qual a média de idade dos passageiros não-sobreviventes?
round(titanic['Age'].loc[titanic['Survived'] == 0].mean(), 2)

30.42

In [64]:
# Quantos homens e quantas mulheres não sobreviveram ao acidente?
nao_sobreviventes = titanic.loc[titanic['Survived'] == 0]
nao_sobreviventes.groupby('Sex')['Sex'].count()

Sex
female     81
male      468
Name: Sex, dtype: int64

In [65]:
# Quantos homens e quantas mulheres sobreviveram ao acidente?
sobreviventes = titanic.loc[titanic['Survived'] == 1]
sobreviventes.groupby('Sex')['Sex'].count()

Sex
female    233
male      109
Name: Sex, dtype: int64

In [ ]:
# Quantos sobreviventes são da primeira classe?
sobreviventes = titanic.loc[titanic['Survived'] == 1]
sobreviventes['Survived'].loc[titanic['Pclass'] == 1].count()

In [66]:
# Quantos não-sobreviventes são da primeira classe?
nao_sobreviventes = titanic.loc[titanic['Survived'] == 0]
nao_sobreviventes['Survived'].loc[titanic['Pclass'] == 1].count()

80

In [67]:
# Quantos sobreviventes são da segunda classe?
sobreviventes = titanic.loc[titanic['Survived'] == 1]
sobreviventes['Survived'].loc[titanic['Pclass'] == 2].count()

87

In [68]:
# Quantos não-sobreviventes são da segunda classe?
nao_sobreviventes = titanic.loc[titanic['Survived'] == 0]
nao_sobreviventes['Survived'].loc[titanic['Pclass'] == 2].count()

97

In [69]:
# Quantos sobreviventes são da terceira classe?
sobreviventes = titanic.loc[titanic['Survived'] == 1]
sobreviventes['Survived'].loc[titanic['Pclass'] == 3].count()

119

In [70]:
# Quantos não-sobreviventes são da terceira classe?
nao_sobreviventes = titanic.loc[titanic['Survived'] == 0]
nao_sobreviventes['Survived'].loc[titanic['Pclass'] == 3].count()

372

In [71]:
# Qual a média de idade dos passageiros da primeira classe?
passageiros = titanic.loc[(titanic['Pclass'] == 1)]
round(passageiros['Age'].mean(),2)

37.05

In [72]:
# Qual a média de idade dos passageiros da segunda classe?
passageiros = titanic.loc[(titanic['Pclass'] == 2)]
round(passageiros['Age'].mean(),2)

29.87

In [73]:
# Qual a média de idade dos passageiros da terceira classe?
passageiros = titanic.loc[(titanic['Pclass'] == 3)]
round(passageiros['Age'].mean(),2)

26.4

In [74]:
# Quantos homens estavam na primeira, segunda e terceira classe?
passageiros = titanic.loc[(titanic['Pclass'] == 1) | (titanic['Pclass'] == 2) | (titanic['Pclass'] == 3)]
passageiros['Sex'].loc[passageiros['Sex'] == 'male'].count()

577

In [75]:
# Quantas mulheres estavam na primeira, segunda e terceira classe?
passageiros = titanic.loc[(titanic['Pclass'] == 1) | (titanic['Pclass'] == 2) | (titanic['Pclass'] == 3)]
passageiros['Sex'].loc[passageiros['Sex'] == 'female'].count()

314

In [80]:
# Qual a média de idade das mulheres sobreviventes das classes 1, 2 e 3?
passageiros = titanic.loc[(titanic['Survived'] == 1) & (titanic['Sex'] == 'female') & (titanic['Pclass'] == 1) | (titanic['Pclass'] == 2) | (titanic['Pclass'] == 3)]
round(passageiros.groupby('Pclass')['Age'].mean(),2)

Pclass
1    34.42
2    29.87
3    26.40
Name: Age, dtype: float64

In [108]:
# Qual a média de idade das mulheres não sobreviventes das classes 1, 2 e 3?
passageiros = titanic.loc[(titanic['Survived'] == 0) & (titanic['Sex'] == 'female') & (titanic['Pclass'] == 1) | (titanic['Pclass'] == 2) | (titanic['Pclass'] == 3)]
result = round(passageiros.groupby('Pclass')['Age'].mean(),2)
result = result.rename_axis("Média de idade das mulheres não sobreviventes das classes 1, 2 e 3")
result

Média de idade das mulheres não sobreviventes das classes 1, 2 e 3
1    25.67
2    29.87
3    26.40
Name: Age, dtype: float64

In [94]:
# Qual a menor idade dos sobreviventes?
idade = titanic['Age'].loc[titanic['Survived']==1].sort_values()
idade.min()

0.42

In [30]:
# Qual o sexo dele(a)?
titanic['Sex'].loc[titanic['Age']== 0.42]

803    male
Name: Sex, dtype: object

In [31]:
# Qual a classe dele(a)?
titanic['Pclass'].loc[titanic['Age']== 0.42]

803    3
Name: Pclass, dtype: int64

In [23]:
# Qual a menor idade dos não sobreviventes?
idade = titanic['Age'].loc[titanic['Survived']==0].sort_values()
idade.min()

1.0

In [26]:
# Qual o sexo dele(a)?
titanic['Sex'].loc[(titanic['Age'] == 1.0) & (titanic['Survived']==0)]

164    male
386    male
Name: Sex, dtype: object

In [21]:
titanic2 = titanic.sort_values(by='Age', ascending=False).head(5)
titanic2

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q

In [28]:
# Qual a classe dele(a)?
titanic['Pclass'].loc[(titanic['Age'] == 1.0) & (titanic['Survived']==0)]

164    3
386    3
Name: Pclass, dtype: int64

In [38]:
# Qual a maior idade dos sobreviventes
idade = titanic['Age'].loc[titanic['Survived']==1].sort_values(ascending=False)
idade.max()

80.0

In [53]:
# Qual o sexo dele?
sexo = titanic['Sex'].loc[titanic['Age'] == titanic['Age'].loc[titanic['Survived']==1].sort_values().max()]
sexo

630    male
Name: Sex, dtype: object

In [44]:
classe = titanic['Pclass'].loc[titanic['Age'] == titanic['Age'].loc[titanic['Survived']==1].sort_values().max()]
classe

630    1
Name: Pclass, dtype: int64

In [46]:
# Qual a maior idade dos não-sobreviventes?
idade = titanic['Age'].loc[titanic['Survived']==0].sort_values(ascending=False)
idade.max()

74.0

In [50]:
# Qual o sexo dele(a)?
sexo = titanic['Sex'].loc[titanic['Age'] == titanic['Age'].loc[titanic['Survived']==0].sort_values().max()]
sexo

851    male
Name: Sex, dtype: object

In [52]:
# Qual a classe dele(a)?
classe = titanic['Pclass'].loc[titanic['Age'] == titanic['Age'].loc[titanic['Survived']==0].sort_values().max()]
classe

851    3
Name: Pclass, dtype: int64

In [111]:
# Quantos passageiros embarcaram no porto de Cherbourg?
passageiros = titanic.loc[titanic['Embarked'] == 'C']
len(passageiros)

168

In [112]:
# Quantos passageiros embarcaram no porto de Queenstown?
passageiros = titanic.loc[titanic['Embarked'] == 'Q']
len(passageiros)

77

In [113]:
# Quantos passageiros embarcaram no porto de Southamptom?
passageiros = titanic.loc[titanic['Embarked'] == 'S']
len(passageiros)

644

In [114]:
# Quantas mulheres embarcaram no porto de Southamptom?
passageiros = titanic.loc[(titanic['Embarked'] == 'S') & (titanic['Sex'] == 'female')]
len(passageiros)

203

In [115]:
# Quantos homens embaracam no porto de Southamptom?
passageiros = titanic.loc[(titanic['Embarked'] == 'S') & (titanic['Sex'] == 'male')]
len(passageiros)

441